AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.3.0/mcu/apollo510/regs/am_mcu_apollo510_otpinfo1.h
// POWERSTATE13 - Power state register. CPU HP mode, GPU on and/or XYZ peripherals on. Temperature range 0C to 50C.
#define AM_REG_OTP_INFO1_POWERSTATE13_RESVD29_S 29
#define AM_REG_OTP_INFO1_POWERSTATE13_RESVD29_M 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE13_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_OTP_INFO1_POWERSTATE13_RESVD29_Pos 29
#define AM_REG_OTP_INFO1_POWERSTATE13_RESVD29_Msk 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGCVREFSEL_S 28
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGCVREFSEL_M 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGCVREFSEL_Pos 28
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGCACTTRIM_S 21
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGCACTTRIM_Pos 21
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE13_CORELDOTEMPCOTRIM_S 17
#define AM_REG_OTP_INFO1_POWERSTATE13_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE13_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_OTP_INFO1_POWERSTATE13_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_OTP_INFO1_POWERSTATE13_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE13_CORELDOACTTRIM_S 7
#define AM_REG_OTP_INFO1_POWERSTATE13_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE13_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_OTP_INFO1_POWERSTATE13_CORELDOACTTRIM_Pos 7
#define AM_REG_OTP_INFO1_POWERSTATE13_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGFACTTRIM_S 0
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGFACTTRIM_Pos 0
#define AM_REG_OTP_INFO1_POWERSTATE13_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE14 - Power state register. CPU HP mode, GPU on and/or XYZ peripherals on. Temperature range -20C to 0C.
#define AM_REG_OTP_INFO1_POWERSTATE14_RESVD29_S 29
#define AM_REG_OTP_INFO1_POWERSTATE14_RESVD29_M 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE14_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_OTP_INFO1_POWERSTATE14_RESVD29_Pos 29
#define AM_REG_OTP_INFO1_POWERSTATE14_RESVD29_Msk 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGCVREFSEL_S 28
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGCVREFSEL_M 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGCVREFSEL_Pos 28
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGCACTTRIM_S 21
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGCACTTRIM_Pos 21
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE14_CORELDOTEMPCOTRIM_S 17
#define AM_REG_OTP_INFO1_POWERSTATE14_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE14_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_OTP_INFO1_POWERSTATE14_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_OTP_INFO1_POWERSTATE14_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE14_CORELDOACTTRIM_S 7
#define AM_REG_OTP_INFO1_POWERSTATE14_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE14_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_OTP_INFO1_POWERSTATE14_CORELDOACTTRIM_Pos 7
#define AM_REG_OTP_INFO1_POWERSTATE14_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGFACTTRIM_S 0
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGFACTTRIM_Pos 0
#define AM_REG_OTP_INFO1_POWERSTATE14_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE15 - Power state register. CPU HP mode, GPU on and/or XYZ peripherals on. Temperature range -40C to -20C.
#define AM_REG_OTP_INFO1_POWERSTATE15_RESVD29_S 29
#define AM_REG_OTP_INFO1_POWERSTATE15_RESVD29_M 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE15_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_OTP_INFO1_POWERSTATE15_RESVD29_Pos 29
#define AM_REG_OTP_INFO1_POWERSTATE15_RESVD29_Msk 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGCVREFSEL_S 28
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGCVREFSEL_M 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGCVREFSEL_Pos 28
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGCACTTRIM_S 21
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGCACTTRIM_Pos 21
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE15_CORELDOTEMPCOTRIM_S 17
#define AM_REG_OTP_INFO1_POWERSTATE15_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE15_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_OTP_INFO1_POWERSTATE15_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_OTP_INFO1_POWERSTATE15_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE15_CORELDOACTTRIM_S 7
#define AM_REG_OTP_INFO1_POWERSTATE15_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE15_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_OTP_INFO1_POWERSTATE15_CORELDOACTTRIM_Pos 7
#define AM_REG_OTP_INFO1_POWERSTATE15_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGFACTTRIM_S 0
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGFACTTRIM_Pos 0
#define AM_REG_OTP_INFO1_POWERSTATE15_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE16 - Power state register. CPU LP mode, GPU or SDIO on, greater than 50C.
#define AM_REG_OTP_INFO1_POWERSTATE16_RESVD29_S 29
#define AM_REG_OTP_INFO1_POWERSTATE16_RESVD29_M 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE16_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_OTP_INFO1_POWERSTATE16_RESVD29_Pos 29
#define AM_REG_OTP_INFO1_POWERSTATE16_RESVD29_Msk 0xE0000000
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGCVREFSEL_S 28
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGCVREFSEL_M 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGCVREFSEL_Pos 28
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGCACTTRIM_S 21
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGCACTTRIM_Pos 21
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_OTP_INFO1_POWERSTATE16_CORELDOTEMPCOTRIM_S 17
#define AM_REG_OTP_INFO1_POWERSTATE16_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE16_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_OTP_INFO1_POWERSTATE16_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_OTP_INFO1_POWERSTATE16_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_OTP_INFO1_POWERSTATE16_CORELDOACTTRIM_S 7
#define AM_REG_OTP_INFO1_POWERSTATE16_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE16_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_OTP_INFO1_POWERSTATE16_CORELDOACTTRIM_Pos 7
#define AM_REG_OTP_INFO1_POWERSTATE16_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGFACTTRIM_S 0
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGFACTTRIM_Pos 0
#define AM_REG_OTP_INFO1_POWERSTATE16_TVRGFACTTRIM_Msk 0x0000007F

